src/Catalogs/УтвержденныеНаименованияПредметовСнабжения/УтвержденныеНаименованияПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УтвержденныеНаименованияПредметовСнабжения</name>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпределениеУНРус</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпределениеУНАнгл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСФО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодFIIG</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассПоЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/УтвержденныеНаименованияПредметовСнабжения/ManagerModule.bsl
#Область ЗагрузитьКлассификатор

Процедура ЗаполнитьИзКлассификатора() Экспорт
	
	// Удаление
	//Выборка = Справочники.ОКВЭД2.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	СпрОб = Выборка.ПолучитьОбъект();
	//	СпрОб.Удалить();
	//КонецЦикла; 
	
	СпрУНПС = Справочники.УтвержденныеНаименованияПредметовСнабжения;
	ТаблДок = СпрУНПС.ПолучитьМакет("Классификатор");
	
	Всего = ТаблДок.ВысотаТаблицы;
	
	СпрПред = СпрУНПС.ПустаяСсылка();
	//Код УН (INC)	
	//Утвержденное наименование	
	//Определение утвержденного наименования	
	//Класс по ЕКПС	
	//Код СФО	
	//Код FIIG	
	//Item Name	
	//Item Name Definition	
	//Дата изменения
	
	Для сч = 2 По Всего Цикл
		
		#Если Клиент Тогда
			ОбработкаПрерыванияПользователя(); 	
		#КонецЕсли 
		
		КодУН 		 	 = СокрЛП(ТаблДок.Область(сч, 1, сч, 1).Текст);
		Если КодУН = "Код УН (INC)" Тогда
			Продолжить;
		КонецЕсли; 
		
		УтвержденноеНаим = СокрЛП(ТаблДок.Область(сч, 2, сч, 2).Текст); //+
		ОпределУтверНаим = СокрЛП(ТаблДок.Область(сч, 3, сч, 3).Текст); //+
		КлассПоЕКПС 	 = СокрЛП(ТаблДок.Область(сч, 4, сч, 4).Текст);
		КодСФО 	 		 = СокрЛП(ТаблДок.Область(сч, 5, сч, 5).Текст);
		КодFIIG		 	 = СокрЛП(ТаблДок.Область(сч, 6, сч, 6).Текст);
		ItemName		 = СокрЛП(ТаблДок.Область(сч, 7, сч, 7).Текст); //+
		ItemNameDef		 = СокрЛП(ТаблДок.Область(сч, 8, сч, 8).Текст); //+
		ДатаИзменения	 = СокрЛП(ТаблДок.Область(сч, 9, сч, 9).Текст);
		
		Если КодУН = "" И УтвержденноеНаим="" И ОпределУтверНаим="" И КлассПоЕКПС="" И КодСФО="" И КодFIIG="" И ItemName="" И ItemNameDef="" Тогда
			Продолжить;
		КонецЕсли; 
		
		Если КодУН = "" И (НЕ УтвержденноеНаим="" ИЛИ НЕ ОпределУтверНаим="" ИЛИ НЕ ItemName="" ИЛИ НЕ ItemNameDef="" ИЛИ НЕ КлассПоЕКПС="") Тогда
			Если НЕ СпрПред.Пустая() Тогда
				СпрОб = СпрПред.ПолучитьОбъект();
				СпрОб.Наименование 		= ?(Прав(СпрОб.Наименование, 1)="-", СтрЗаменить(СпрОб.Наименование + УтвержденноеНаим, "-", ""), СпрОб.Наименование + " " + УтвержденноеНаим);
				СпрОб.ОпределениеУНРус  = ?(Прав(СпрОб.ОпределениеУНРус, 1)="-", СтрЗаменить(СпрОб.ОпределениеУНРус + " " + ОпределУтверНаим, "-", ""), СпрОб.ОпределениеУНРус + " " + ОпределУтверНаим);
				СпрОб.НаименованиеАнгл  = ?(Прав(СпрОб.НаименованиеАнгл, 1)="-", СтрЗаменить(СпрОб.НаименованиеАнгл + " " + ItemName, "-", ""), СпрОб.НаименованиеАнгл + " " + ItemName);
				СпрОб.ОпределениеУНАнгл = ?(Прав(СпрОб.ОпределениеУНАнгл, 1)="-", СтрЗаменить(СпрОб.ОпределениеУНАнгл + " " + ItemNameDef, "-", ""), СпрОб.ОпределениеУНАнгл + " " + ItemNameDef);
				//++ 26.02.2018 Веденеев П. //тип реквизита изменен со строки на ссылку
				//СпрОб.КлассПоЕКПС 		= ?(Прав(СпрОб.КлассПоЕКПС, 1)="-", СтрЗаменить(СпрОб.КлассПоЕКПС + " " + КлассПоЕКПС, "-", ""), СпрОб.КлассПоЕКПС + " " + КлассПоЕКПС);
				СпрОб.КлассПоЕКПС 		= Справочники.ЕКПС.НайтиПоКоду(СпрОб.КлассПоЕКПС.Код + " " + КлассПоЕКПС);
				//-- 26.02.2018 Веденеев П. //тип реквизита изменен со строки на ссылку
				СпрОб.Записать();
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		Найд = СпрУНПС.НайтиПоКоду(КодУН);
		Если Найд.Пустая() Тогда
			СпрЭлемент = СпрУНПС.СоздатьЭлемент();
		Иначе 
			СпрЭлемент = Найд.ПолучитьОбъект();
		КонецЕсли;
		
		СпрЭлемент.Код = КодУН;
		СпрЭлемент.Наименование = УтвержденноеНаим;
		СпрЭлемент.НаименованиеАнгл = ItemName;
		СпрЭлемент.ОпределениеУНРус = ОпределУтверНаим;
		СпрЭлемент.ОпределениеУНАнгл = ItemNameDef;
		//++ 26.02.2018 Веденеев П. //тип реквизита изменен со строки на ссылку
		//СпрЭлемент.КлассПоЕКПС = КлассПоЕКПС;
		СпрЭлемент.КлассПоЕКПС = Справочники.ЕКПС.НайтиПоКоду(КлассПоЕКПС);
		//-- 26.02.2018 Веденеев П. //тип реквизита изменен со строки на ссылку
		СпрЭлемент.КодСФО = КодСФО;
		СпрЭлемент.КодFIIG = КодFIIG;
		Мес = ?(СтрДлина(ДатаИзменения) = 7, Прав(ДатаИзменения,1), Прав(ДатаИзменения,2));
		Попытка
			СпрЭлемент.ДатаИзменения = ?(ДатаИзменения="", Дата(1,1,1), Дата(Лев(ДатаИзменения,4), Мес, Сред(ДатаИзменения, 5, 2)));
		Исключение
		    СпрЭлемент.ДатаИзменения = Дата(1,1,1);
		КонецПопытки;
		
		Попытка
			СпрЭлемент.Записать();
			СпрПред = СпрЭлемент.Ссылка;
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти
